Repository: siddharthkanna/AgriRent
Catalog: lib/l10n/app_*.arb
Languages: ml, ta, te

source: Popular Equipment
ml: ലോകപ്രിയ ഉപകരണങ്ങൾ
ta: பிரபலமான உபகரணங்கள்
te: జనప్రియ పరికరాలు

source: Equipment Categories
ml: ഉപകരണ വിഭാഗങ്ങൾ
ta: உபகரண வகைகள்
te: పరికర వర్గాలు

source: Welcome
ml: സ്വാഗതം
ta: வரவேற்கிறேன்
te: స్వాగతం

source: Market Place
ml: മാർക്കറ്റ് സ്ഥലം
ta: சந்தை
te: మార్కెట్ ప్లేస్

source: Search for Equipment
ml: ഉപകരണങ്ങൾ തിരയുക
ta: உபகரணங்களை தேடுக
te: పరికరానికి శోధించండి

source: Post your Equipment
ml: നിങ്ങളുടെ ഉപകരണം പോസ്റ്റ് ചെയ്യുക
ta: உங்கள் உபகரணத்தை போஸ்ட் செய்க
te: మీ పరికరాన్ని పోస్ట్ చేయండి

source: Take Photo
ml: ഫോട്ടോ എടുക്കുക
ta: படம் எடு
te: ఫోటో తీసుకోండి

source: Pick Image
ml: ചിത്രം തിരഞ്ഞെടുക്കുക
ta: படத்தைத் தேர்ந்தெடு
te: ఇమేజ్ ఎంపిక చేయండి

source: Name
ml: പേര്
ta: பெயர்
te: పేరు

source: Category
ml: വിഭാഗം
ta: வகை
te: వర్గం

source: Description
ml: വിവരണം
ta: விளக்கம்
te: వివరణ

source: Rental Price
ml: അടക്കം വില
ta: வாடகை விலை
te: రెంటల్ ధర

source: Location
ml: സ്ഥലം
ta: இருப்பிடம்
te: స్థానం

source: Next
ml: അടുത്തത്
ta: அடுத்து
te: తరువాత

source: Features
ml: സവിശേഷതകൾ
ta: அம்சங்கள்
te: లక్షణాలు

source: Condition
ml: അവസ്ഥ
ta: நிலை
te: స్థితి

source: Availability Dates
ml: ലഭ്യത തീയതികൾ
ta: கிடைக்கும் தேதிகள்
te: అందుబాటులో తేదీలు

source: Select Dates
ml: തീയതികൾ തിരഞ്ഞെടുക്കുക
ta: தேதிகளை தேர்ந்தெடு
te: తేదీలను ఎంచుకోండి

source: Renter Pickup
ml: വാട്ടർ പിക്കപ്പ്
ta: வாடிக்கையாளர் பிக்கப்
te: రెంటర్ పికప్

source: Owner Delivery
ml: ഓവണർ ഡെലിവറി
ta: உரிமையாளர் விநியோகம்
te: యజమాని వితరణ

source: Both
ml: ഇരട്ടിയായി
ta: இரண்டு
te: రెండు

source: Additional Details
ml: അതിന്റെ കൂടുതൽ വിശദാംശങ്ങൾ
ta: கூடுதல் விவரங்கள்
te: అదనపు వివరాలు

source: Chats
ml: ചാറ്റുകൾ
ta: உரைகள்
te: చాట్లు

source: Profile Settings
ml: പ്രൊഫൈൽ ക്രമീകരണങ്ങൾ
ta: சுயவிவர அமைப்புகள்
te: ప్రొఫైల్ సెట్టింగులు

source: Renting History
ml: വാടക ചരിത്രം
ta: வாடகை வரலாறு
te: అద్దె చరిత్ర

source: Posting History
ml: പോസ്റ്റിംഗ് ചരിത്രം
ta: அனுப்புதல் வரலாறு
te: పోస్టింగ్ చరిత్ర

source: Your Bookmarks
ml: നിങ്ങളുടെ ബുക്മാർക്കുകൾ
ta: உங்கள் புக்மார்க்ஸ்
te: మీ బుక్మార్క్స్

source: Sign Out
ml: പുറത്തുകടക്കുക
ta: வெளியேறு
te: సైన్ ఔట్

source: Home
ml: ഹോം
ta: முகப்பு
te: హోమ్

source: Rent
ml: അടക്കം
ta: வாடகை
te: అద్దులు

source: Post
ml: പോസ്റ്റ്
ta: அனுப்பவும்
te: పోస్ట్

source: Chat
ml: ചാറ്റ്
ta: அரட்டை
te: చాట్

source: Profile
ml: പ്രൊഫൈൽ
ta: சுயவிவரம்
te: ప్రొఫైల్

source: Baler
ml: മൂട്ട കെട്ടുന്ന യന്ത്രം
ta: கூட்டு கட்டு இயந்திரம்
te: గడ్డి కట్టు యంత్రం

source: Cultivator
ml: കultiവേറ്റർ
ta: குल्டிவேட்டர்
te: దుక్కి గల పరికరం

source: Harvester
ml: മുറിച്ചെടുക്കുന്ന യന്ത്രം
ta: அறுவடை இயந்திரம்
te: కోత యంత్రం

source: Rake
ml: റേക്ക്
ta: வரைகி
te: గరుకు

source: Seeder
ml: വിതക്കുന്ന യന്ത്രം
ta: விதைப்பு இயந்திரம்
te: విత్తనాల యంత్రం

source: Sprayer
ml: തളിക്കുന്ന യന്ത്രം
ta: தெளிப்பான்
te: పిచికారీ యంత్రం

source: Spreader
ml: പരത്തുന്ന യന്ത്രം
ta: பரப்பு இயந்திரம்
te: చల్లు యంత్రం

source: Sprinkler
ml: സ്പ്രിംങ്കളർ
ta: ஸ்பிரிங்க்ளர்
te: స్ప్రింక్లర్

source: Wheel Barrow
ml: ചക്രവണ്ടി
ta: சக்கர வண்டி
te: చక్ర బండి

source: Your Profile
ml: നിങ്ങളുടെ പ്രൊഫൈൽ
ta: உங்கள் சுயவிவரம்
te: మీ ప్రొఫైల్

# chooseYourLanguages
source: Choose your language
ml: നിങ്ങളുടെ ഭാഷകൾ തിരഞ്ഞെടുക്കുക
ta: உங்கள் மொழிகளைத் தேர்ந்தெடுக்கவும்
te: మీ భాషలను ఎంచుకోండి

source: No search results found
ml: എന്തെങ്കിലും തിരയലുകൾ ലഭ്യമല്ല
ta: எந்த தேடல் முடிவுகளும் கிடைக்கவில்லை
te: ఎటువంటి ఫలితాలు కనుగొనబడలేదు
